# NumberPartitionParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..NumberPartitionParam Property
ParameterTypeId Class See Also
---
"Partition"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId NumberPartitionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NumberPartitionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NumberPartitionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace